app/Controllers/Carrito.php

    public function vista_carrito()
    {
        $usuario = session()->get('usuario');

        if ($usuario === null) {
            return redirect()->to(base_url('iniciarsesion'));
        }

        $carritoModel = new \App\Models\carritomodel();
        $productosCarrito = $carritoModel->where('id_usuario', $usuario['id_usuario'])->findAll();
---
SELECT *
FROM `carrito`
WHERE `id_usuario` = '1'

    public function agregarAlCarrito()
    {
        $producto_id = $this->request->getPost('producto_id');
        $cantidad = $this->request->getPost('cantidad');
        $precio = $this->request->getPost('precio');
        $total= $cantidad * $precio;

        $carritoModel = new \App\Models\carritomodel();
        $usuario = session()->get('usuario');
        $id_u = $usuario['id_usuario'];
        $carritoModel->insert([
            'id_talle_producto' => $producto_id,
            'cantidad' => $cantidad,
            'id_usuario' => $id_u,
        ]);
---
INSERT INTO `carrito` (`id_talle_producto`, `cantidad`, `id_usuario`) VALUES ('34', '1', '1')