app/Controllers/compra.php

SELECT *
FROM `carrito`
WHERE `id_usuario` = '1'
---
    public function finalizarCompra()
    {

        $usuario = session()->get('usuario');

        if ($usuario === null) {
            return redirect()->to(base_url('iniciarsesion'));
        }

        $carritoModel     = new \App\Models\carritomodel();
        $productosCarrito = $carritoModel->where('id_usuario', $usuario['id_usuario'])->findAll();

INSERT INTO `venta` (`id_usuario`, `fecha`, `id_datos_envio`) VALUES ('1', '2023-11-30 04:03:13', 69)
---
    public function pagopaypal($provincia, $ciudad, $calle, $codigo_postal, $numero, $piso, $observaciones)
    {
        $usuario = session()->get('usuario');

        // Crear una instancia del modelo DatosEnvioModel
        $datosEnvioModel   = new \App\Models\DatosEnvioModel();
        $ventaModel        = new \App\Models\ventamodel();
        $detalleVentaModel = new \App\Models\historialcompra(); // Cambiado a HistorialCompraModel


        // Preparar los datos para ser guardados
        $data = [
            'id_usuario'      => $usuario['id_usuario'],
            'provincia'       => $provincia,
            'ciudad'          => $ciudad,
            'calle'           => $calle,
            'codigo_postal'   => $codigo_postal,
            'numero'          => $numero,
            'piso'            => $piso,
            'observaciones'   => $observaciones
        ];

        // Guardar los datos de envío en la base de datos
        $idDatosEnvio = $datosEnvioModel->guardarDatosEnvio($data);

        // Insertar los datos de dirección en la base de datos

        // Crear una nueva venta
        $idVenta = $ventaModel->insert([
            'id_usuario' => $usuario['id_usuario'],
            'fecha' => date('Y-m-d H:i:s'),
            'id_datos_envio' => $idDatosEnvio // Asegúrate de que $idDatosEnvio sea un valor válido
        ]);

SELECT *
FROM `carrito`
WHERE `id_usuario` = '1'
INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `cantidad`, `precio`) VALUES (41, '36', '1', '3500')
DELETE FROM `carrito`
WHERE `id_usuario` = '1'
---

        $carritoModel = new \App\Models\CarritoModel();
        $modelprod = new \App\Models\modelprod();
        $productosCarrito = $carritoModel->where('id_usuario', $usuario['id_usuario'])->findAll();

        foreach ($productosCarrito as $producto) {
            // Insertar detalles de la venta
            $detalleVentaModel->insert([
                'id_venta'      => $idVenta,
                'id_producto'   => $producto['id_talle_producto'],
                'cantidad'      => $producto['cantidad'],
                'precio'        => isset($producto['precio']) ? $producto['precio'] : $modelprod->obtenerPrecioProductoPorId($producto['id_talle_producto'])]);
        }

        // Vaciar el carrito
        $carritoModel->where('id_usuario', $usuario['id_usuario'])->delete();