app/Models/callemodel.php

    public function obtenerIdCallePorNombre($nombre)
    {
        $result = $this->select('id')->where('nombre', $nombre)->first();
---
SELECT `id`
FROM `calle`
WHERE `nombre` = 'messi'
 LIMIT 1

    public function insertarCalle($data)
    {
        $this->insert($data);
---
INSERT INTO `calle` (`nombre`) VALUES ('messi')