app/Models/ciudadmodel.php

    public function obtenerIdCiudadPorNombre($nombre)
    {
        $result = $this->select('id')->where('nombre', $nombre)->first();
---
SELECT `id`
FROM `ciudad`
WHERE `nombre` = 'grosso'
 LIMIT 1

    public function insertarCiudad($data)
    {
        $this->insert($data);
---
INSERT INTO `ciudad` (`id_provincia`, `nombre`) VALUES (33, 'grosso')