app/Models/datosenviomodel.php

INSERT INTO `datos_envio` (`id_usuario`, `provincia`, `ciudad`, `calle`, `codigo_postal`, `numero`, `piso`, `observaciones`) VALUES ('1', 'santiago del estero', 'grosso', 'messi', '1010', '10', '0', 'genio')
---
    public function guardarDatosEnvio($data)
    {
        return $this->insert($data);