app/Models/direccionmodel.php

INSERT INTO `direccion` (`id_calle`, `id_ciudad`, `id_venta`, `num_calle`, `direccion`) VALUES ('6', '40', 41, '10', 'messi')
---
    public function insertarDireccion($data)
    {
        $this->insert($data);