app/Models/modelprod.php

  public function obtenerPrecioProductoPorId($id_producto)
    {
        // Recupera y devuelve el precio del producto con el ID proporcionado
        // Debes reemplazar el código a continuación con tu lógica real para obtener el precio desde la base de datos
        $query = $this->db->table('producto')->select('precio')->where('id_producto', $id_producto)->get();
---
SELECT `precio`
FROM `producto`
WHERE `id_producto` = '36'