app/Models/provinciamodel.php

INSERT INTO `provincia` (`nombre`) VALUES ('santiago del estero')
---
    public function insertarProvincia($data)
    {
        $this->insert($data);