app/Models/ProvinciasModel.php

    public function obtenerProvincias()
    {
        return $this->findAll();
---
SELECT *
FROM `provincia`